In [2]:
import numpy as np
import pandas as pd

In [5]:
x=['a','b','c','d','e','f','g','h','i']
y=[1,2,3,4,5,6,7,8,9]
z={'a':1,'b':2,'c':3,'d':4,'e':5,'f':6,'g':7,'h':8,'i':9,'j':10,
   'k':11,'l':11,'m':13,'n':14,'o':15,'p':16,'q':17,'r':18,'s':19,'t':20,
   'u':21,'v':22,'w':23,'x':24,'y':25,'z':26}

In [6]:
v=pd.Series(x,y)
s=pd.Series(y,x)

In [7]:
v

1    a
2    b
3    c
4    d
5    e
6    f
7    g
8    h
9    i
dtype: object

In [8]:
s

a    1
b    2
c    3
d    4
e    5
f    6
g    7
h    8
i    9
dtype: int64

In [26]:
A=[1,2,3,4]
B=[5,6,7,8]
C=[9,10,11,12]
D=[13,12,13,43]
E=[14,324,42,12]

df=pd.DataFrame([A,B,C,D,E],['a','b','c','d','e'],['w','x','y','z'])

In [29]:
df

    w    x   y   z
a   1    2   3   4
b   5    6   7   8
c   9   10  11  12
d  13   12  13  43
e  14  324  42  12

In [30]:
df['Total w+x']=df['w']+df['x']

In [31]:
df

    w    x   y   z  Total w+x
a   1    2   3   4          3
b   5    6   7   8         11
c   9   10  11  12         19
d  13   12  13  43         25
e  14  324  42  12        338

In [32]:
df['w*z']=df['w']*df['z']

In [33]:
df

    w    x   y   z  Total w+x  w*z
a   1    2   3   4          3    4
b   5    6   7   8         11   40
c   9   10  11  12         19  108
d  13   12  13  43         25  559
e  14  324  42  12        338  168

In [34]:
df['z/x']=df['z']/df['x']

In [35]:
df

    w    x   y   z  Total w+x  w*z       z/x
a   1    2   3   4          3    4  2.000000
b   5    6   7   8         11   40  1.333333
c   9   10  11  12         19  108  1.200000
d  13   12  13  43         25  559  3.583333
e  14  324  42  12        338  168  0.037037

In [36]:
df['y-z']=df['y']-df['z']

In [37]:
df

    w    x   y   z  Total w+x  w*z       z/x  y-z
a   1    2   3   4          3    4  2.000000   -1
b   5    6   7   8         11   40  1.333333   -1
c   9   10  11  12         19  108  1.200000   -1
d  13   12  13  43         25  559  3.583333  -30
e  14  324  42  12        338  168  0.037037   30

In [38]:
df.drop('a')

    w    x   y   z  Total w+x  w*z       z/x  y-z
b   5    6   7   8         11   40  1.333333   -1
c   9   10  11  12         19  108  1.200000   -1
d  13   12  13  43         25  559  3.583333  -30
e  14  324  42  12        338  168  0.037037   30

In [39]:
df

    w    x   y   z  Total w+x  w*z       z/x  y-z
a   1    2   3   4          3    4  2.000000   -1
b   5    6   7   8         11   40  1.333333   -1
c   9   10  11  12         19  108  1.200000   -1
d  13   12  13  43         25  559  3.583333  -30
e  14  324  42  12        338  168  0.037037   30

In [40]:
df.drop('e',inplace=True)

In [41]:
df

    w   x   y   z  Total w+x  w*z       z/x  y-z
a   1   2   3   4          3    4  2.000000   -1
b   5   6   7   8         11   40  1.333333   -1
c   9  10  11  12         19  108  1.200000   -1
d  13  12  13  43         25  559  3.583333  -30

In [25]:
df

    w   x   y   z  Total w+x  w*z       z/x  y-z
a   1   2   3   4          3    4  2.000000   -1
b   5   6   7   8         11   40  1.333333   -1
c   9  10  11  12         19  108  1.200000   -1
d  13  12  13  43         25  559  3.583333  -30

In [26]:
df['w']

a     1
b     5
c     9
d    13
Name: w, dtype: int64

In [27]:
df.loc['c']

w              9.0
x             10.0
y             11.0
z             12.0
Total w+x     19.0
w*z          108.0
z/x            1.2
y-z           -1.0
Name: c, dtype: float64

In [28]:
#addtion of df
g=df.loc['b','w']+df.loc['c','Total w+x']

In [29]:
g

24

In [30]:
df>4

       w      x      y      z  Total w+x    w*z    z/x    y-z
a  False  False  False  False      False  False  False  False
b   True   True   True   True       True   True  False  False
c   True   True   True   True       True   True  False  False
d   True   True   True   True       True   True  False  False

In [31]:
df<2

       w      x      y      z  Total w+x    w*z    z/x   y-z
a   True  False  False  False      False  False  False  True
b  False  False  False  False      False  False   True  True
c  False  False  False  False      False  False   True  True
d  False  False  False  False      False  False  False  True

In [32]:
df[(df['w']>8) & (df['y']>11)]

    w   x   y   z  Total w+x  w*z       z/x  y-z
d  13  12  13  43         25  559  3.583333  -30

In [33]:
df[(df['w']>8) | (df['y']>11)]

    w   x   y   z  Total w+x  w*z       z/x  y-z
c   9  10  11  12         19  108  1.200000   -1
d  13  12  13  43         25  559  3.583333  -30

#pandas Data Analayic tuts

In [34]:
e={'a':[1,2,3,4],'b':[2,4,5,np.nan],'c':[4,1,np.nan,2],'d':[4,2,np.nan,np.nan],'e':[5,np.nan,np.nan,np.nan]}

In [35]:
e

{'a': [1, 2, 3, 4],
 'b': [2, 4, 5, nan],
 'c': [4, 1, nan, 2],
 'd': [4, 2, nan, nan],
 'e': [5, nan, nan, nan]}

In [36]:
e=pd.DataFrame(e)

In [37]:
e

   a    b    c    d    e
0  1  2.0  4.0  4.0  5.0
1  2  4.0  1.0  2.0  NaN
2  3  5.0  NaN  NaN  NaN
3  4  NaN  2.0  NaN  NaN

In [38]:
e.dropna(axis=0)

   a    b    c    d    e
0  1  2.0  4.0  4.0  5.0

In [39]:
e.dropna(axis=1)

   a
0  1
1  2
2  3
3  4

In [40]:
e.dropna(thresh=3)

   a    b    c    d    e
0  1  2.0  4.0  4.0  5.0
1  2  4.0  1.0  2.0  NaN

In [41]:
e.dropna(thresh=5)

   a    b    c    d    e
0  1  2.0  4.0  4.0  5.0

In [42]:
e.dropna(thresh=4)

   a    b    c    d    e
0  1  2.0  4.0  4.0  5.0
1  2  4.0  1.0  2.0  NaN

In [43]:
e.fillna(2)

   a    b    c    d    e
0  1  2.0  4.0  4.0  5.0
1  2  4.0  1.0  2.0  2.0
2  3  5.0  2.0  2.0  2.0
3  4  2.0  2.0  2.0  2.0

In [44]:
e

   a    b    c    d    e
0  1  2.0  4.0  4.0  5.0
1  2  4.0  1.0  2.0  NaN
2  3  5.0  NaN  NaN  NaN
3  4  NaN  2.0  NaN  NaN

In [45]:
e['b']

0    2.0
1    4.0
2    5.0
3    NaN
Name: b, dtype: float64

In [46]:
e['b'].fillna(value=e['b'].mean())

0    2.000000
1    4.000000
2    5.000000
3    3.666667
Name: b, dtype: float64

In [47]:
#mean() the average function
(2+4+5)/3

3.6666666666666665

In [48]:
e.loc[0].fillna(value=e.loc[3].mean(),)

a    1.0
b    2.0
c    4.0
d    4.0
e    5.0
Name: 0, dtype: float64

In [49]:
e

   a    b    c    d    e
0  1  2.0  4.0  4.0  5.0
1  2  4.0  1.0  2.0  NaN
2  3  5.0  NaN  NaN  NaN
3  4  NaN  2.0  NaN  NaN

In [50]:
puu={'item':['apple','apple','bannan','bannan','gunne','gunne','gunne'],'days':['mon','tus','wed','ths','fri','sta','sun'],'sales':[100,23,42,14,13,41,51]}

In [51]:
puu

{'item': ['apple', 'apple', 'bannan', 'bannan', 'gunne', 'gunne', 'gunne'],
 'days': ['mon', 'tus', 'wed', 'ths', 'fri', 'sta', 'sun'],
 'sales': [100, 23, 42, 14, 13, 41, 51]}

In [52]:
p=pd.DataFrame(puu)

In [53]:
p

     item days  sales
0   apple  mon    100
1   apple  tus     23
2  bannan  wed     42
3  bannan  ths     14
4   gunne  fri     13
5   gunne  sta     41
6   gunne  sun     51

In [54]:
x=p.groupby('item')

In [55]:
#mean
x.mean()

        sales
item
apple    61.5
bannan   28.0
gunne    35.0

In [56]:
#standard
x.std()

            sales
item
apple   54.447222
bannan  19.798990
gunne   19.697716

In [57]:
x.count()

        days  sales
item
apple      2      2
bannan     2      2
gunne      3      3

In [58]:
x.max()

       days  sales
item
apple   tus    100
bannan  wed     42
gunne   sun     51

In [59]:
x.min()

       days  sales
item
apple   mon     23
bannan  ths     14
gunne   fri     13

In [60]:
p

     item days  sales
0   apple  mon    100
1   apple  tus     23
2  bannan  wed     42
3  bannan  ths     14
4   gunne  fri     13
5   gunne  sta     41
6   gunne  sun     51

In [61]:
x.describe()

       sales
       count  mean        std   min    25%   50%    75%    max
item
apple    2.0  61.5  54.447222  23.0  42.25  61.5  80.75  100.0
bannan   2.0  28.0  19.798990  14.0  21.00  28.0  35.00   42.0
gunne    3.0  35.0  19.697716  13.0  27.00  41.0  46.00   51.0

In [62]:
x.describe().transpose()

item              apple    bannan      gunne
sales count    2.000000   2.00000   3.000000
      mean    61.500000  28.00000  35.000000
      std     54.447222  19.79899  19.697716
      min     23.000000  14.00000  13.000000
      25%     42.250000  21.00000  27.000000
      50%     61.500000  28.00000  41.000000
      75%     80.750000  35.00000  46.000000
      max    100.000000  42.00000  51.000000

In [63]:
f={'a':[1,2,3],'b':[4,5,6]}
g={'c':[1,2,3],'d':[10,11,12]}

In [64]:
f=pd.DataFrame(f,index=['p1','p2','p3'])

In [65]:
g=pd.DataFrame(g,index=['p4','p5','p6'])

In [66]:
f

    a  b
p1  1  4
p2  2  5
p3  3  6

In [67]:
g

    c   d
p4  1  10
p5  2  11
p6  3  12

In [68]:
f.join(g,how='outer')

      a    b    c     d
p1  1.0  4.0  NaN   NaN
p2  2.0  5.0  NaN   NaN
p3  3.0  6.0  NaN   NaN
p4  NaN  NaN  1.0  10.0
p5  NaN  NaN  2.0  11.0
p6  NaN  NaN  3.0  12.0

In [5]:
a={'a':[1,1,3,4,5],'b':[2,2,4,5,6],'c':[3,3,2,1,3],'e':[4,2,4,3,4],'d':[4,3,4,3,4]}
b={'a':[1,1,1,1,1],'d':[2,2,2,2,2],'f':[3,3,3,3,3],'e':[4,4,4,4,4],'r':[6,6,6,6,6]}
c={'a':[1,1,1,1,1],'b':[2,2,2,2,2],'c':[3,3,3,3,3],'e':[4,4,4,4,4],'d':[4,4,4,4,4]}

In [6]:
a

{'a': [1, 1, 3, 4, 5],
 'b': [2, 2, 4, 5, 6],
 'c': [3, 3, 2, 1, 3],
 'e': [4, 2, 4, 3, 4],
 'd': [4, 3, 4, 3, 4]}

In [12]:
a=pd.DataFrame(a,index=[1,2,3,4,5])
b=pd.DataFrame(b,index=[1,2,3,4,5])
cr=pd.DataFrame(c,index=[1,2,3,4,5])

In [13]:
a

   a  b  c  e  d
1  1  2  3  4  4
2  1  2  3  2  3
3  3  4  2  4  4
4  4  5  1  3  3
5  5  6  3  4  4

In [14]:
pd.concat([a,b],axis=1)

   a  b  c  e  d  a  d  f  e  r
1  1  2  3  4  4  1  2  3  4  6
2  1  2  3  2  3  1  2  3  4  6
3  3  4  2  4  4  1  2  3  4  6
4  4  5  1  3  3  1  2  3  4  6
5  5  6  3  4  4  1  2  3  4  6

In [15]:
def inc(x):
    if x>=1:
        x=x+10

In [21]:
a['b'].nunique()

4

In [23]:
a['c'].value_counts()

3    3
2    1
1    1
Name: c, dtype: int64

In [24]:
a.isnull()

       a      b      c      e      d
1  False  False  False  False  False
2  False  False  False  False  False
3  False  False  False  False  False
4  False  False  False  False  False
5  False  False  False  False  False

In [48]:
fe=pd.read_csv('employees.csv',header=0,escapechar='\\')

In [49]:
fe

,EmployeeID,LastName,FirstName,Title,TitleOfCourtesy,BirthDate,HireDate,Address,City,Region,PostalCode,Country,HomePhone,Extension,Photo,Notes,ReportsTo,PhotoPath
0,1,Davolio,Nancy,Sales Representative,Ms.,1948-12-08 00:00:00.000,1992-05-01 00:00:00.000,507 - 20th Ave. E.Apt. 2A,Seattle,WA,98122,USA,(206) 555-9857,5467,0x151C2F00020000000D000E0014002100FFFFFFFF4269...,Education includes a BA in psychology from Col...,2.0,http://accweb/emmployees/davolio.bmp
1,2,Fuller,Andrew,Vice President Sales,Dr.,1952-02-19 00:00:00.000,1992-08-14 00:00:00.000,908 W. Capital Way,Tacoma,WA,98401,USA,(206) 555-9482,3457,0x151C2F00020000000D000E0014002100FFFFFFFF4269...,Andrew received his BTS commercial in 1974 and...,NaN,http://accweb/emmployees/fuller.bmp
2,3,Leverling,Janet,Sales Representative,Ms.,1963-08-30 00:00:00.000,1992-04-01 00:00:00.000,722 Moss Bay Blvd.,Kirkland,WA,98033,USA,(206) 555-3412,3355,0x151C2F00020000000D000E0014002100FFFFFFFF4269...,Janet has a BS degree in chemistry from Boston...,2.0,http://accweb/emmployees/leverling.bmp
3,4,Peacock,Margaret,Sales Representative,Mrs.,1937-09-19 00:00:00.000,1993-05-03 00:00:00.000,4110 Old Redmond Rd.,Redmond,WA,98052,USA,(206) 555-8122,5176,0x151C2F00020000000D000E0014002100FFFFFFFF4269...,Margaret holds a BA in English literature from...,2.0,http://accweb/emmployees/peacock.bmp
4,5,Buchanan,Steven,Sales Manager,Mr.,1955-03-04 00:00:00.000,1993-10-17 00:00:00.000,14 Garrett Hill,London,NaN,SW1 8JR,UK,(71) 555-4848,3453,0x151C2F00020000000D000E0014002100FFFFFFFF4269...,Steven Buchanan graduated from St. Andrews Uni...,2.0,http://accweb/emmployees/buchanan.bmp
5,6,Suyama,Michael,Sales Representative,Mr.,1963-07-02 00:00:00.000,1993-10-17 00:00:00.000,Coventry HouseMiner Rd.,London,NaN,EC2 7JR,UK,(71) 555-7773,428,0x151C2F00020000000D000E0014002100FFFFFFFF4269...,Michael is a graduate of Sussex University (MA...,5.0,http://accweb/emmployees/davolio.bmp
6,7,King,Robert,Sales Representative,Mr.,1960-05-29 00:00:00.000,1994-01-02 00:00:00.000,Edgeham HollowWinchester Way,London,NaN,RG1 9SP,UK,(71) 555-5598,465,0x151C2F00020000000D000E0014002100FFFFFFFF4269...,Robert King served in the Peace Corps and trav...,5.0,http://accweb/emmployees/davolio.bmp
7,8,Callahan,Laura,Inside Sales Coordinator,Ms.,1958-01-09 00:00:00.000,1994-03-05 00:00:00.000,4726 - 11th Ave. N.E.,Seattle,WA,98105,USA,(206) 555-1189,2344,0x151C2F00020000000D000E0014002100FFFFFFFF4269...,Laura received a BA in psychology from the Uni...,2.0,http://accweb/emmployees/davolio.bmp
8,9,Dodsworth,Anne,Sales Representative,Ms.,1966-01-27 00:00:00.000,1994-11-15 00:00:00.000,7 Houndstooth Rd.,London,NaN,WG2 7LT,UK,(71) 555-4444,452,0x151C2F00020000000D000E0014002100FFFFFFFF4269...,Anne has a BA degree in English from St. Lawre...,5.0,http://accweb/emmployees/davolio.bmp